UCB_CS61_lec13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 23:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第十三课 Java Packages</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第十三课 Java Packages</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3e49834">JAVA PACKAGES</a>
<ul>
<li><a href="#orga5a0c44">Using Packages</a></li>
<li><a href="#org5d99861">Building Packages</a></li>
</ul>
</li>
<li><a href="#org0fbb6c4">ITERATORS</a></li>
</ul>
</div>
</div>



<div id="org3e49834" class="outline-2">
<h2 id="org3e49834">JAVA PACKAGES</h2>
<div class="outline-text-2" id="text-org3e49834">
<p>
In Java, a <span class="underline">package</span> is a collection of classes and Java interfaces, and
possibly subpackages, that trust each other.  Packages have three benefits.
</p>

<pre class="example">
(1)  Packages can contain hidden classes that are used by the package but are
     not visible or accessible outside the package.
(2)  Classes in packages can have fields and methods that are visible by all
     classes inside the package, but not outside.
(3)  Different packages can have classes with the same name.  For example,
     java.awt.Frame and photo.Frame.
</pre>

<p>
Here are two examples of packages.
</p>

<pre class="example">
(1)  java.io is a package of I/O-related classes in the standard Java
     libraries.
(2)  Homework 4 uses "list", a package containing the classes DList and
     DListNode.  You will be adding two additional classes to the list package.
</pre>

<p>
Package names are hierarchical.  java.awt.image.Model refers to the class Model
inside the package image inside the package awt inside the package java.
</p>
</div>

<div id="orga5a0c44" class="outline-3">
<h3 id="orga5a0c44">Using Packages</h3>
<div class="outline-text-3" id="text-orga5a0c44">
<p>
You can address any class, field, or method with a fully-qualified name.
Here's an example of all three in one.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">lang</span>.System.out.println(<span style="color: #2d9574;">"My fingers are tired."</span>);
</pre>
</div>

<p>
Java's "import" command saves us from the tedium of using fully-qualified names
all the time.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">io</span>.<span style="color: #ce537a; font-weight: bold;">File</span>;  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Can now refer to File class, not just java.io.File.</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">io</span>.*;     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Can now refer to everything in java.io.</span>
</pre>
</div>

<p>
Every Java program implicitly imports java.lang.*, so you don't have to import
it explicitly to use System.out.println().  However, if you import packages
that contain multiple classes with the same name, you'll need to qualify their
names explicitly throughout your code.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">awt</span>.Frame.add(<span style="color: #a45bad;">photo</span>.Frame.<span style="color: #ce537a; font-weight: bold;">canvas</span>);
</pre>
</div>

<p>
Any package you create must appear in a directory of the same name.  For
example, the photo.Frame class bytecode appears in photo/Frame.class, and
x.y.z.Class appears in x/y/z/Class.class.  Where are the photo and x
directories?  They can appear in any of the directories on your "classpath".
You can specify a classpath on the command line, as when you type
</p>

<div class="org-src-container">
<pre class="src src-shell">javac -cp <span style="color: #2d9574;">".:~jrs/classes:libraries.jar"</span> *.java
</pre>
</div>

<p>
This means that Java first looks in ".", the current directory, then looks in
~jrs/classes/, then finally in the <span class="underline">Java_archive</span> libraries.jar when it's
looking for the photo and x directories.  The classpath does not include the
location of the Java standard library packages (those beginning with java or
javax).  The Java compiler knows where to find them.
</p>
</div>
</div>

<div id="org5d99861" class="outline-3">
<h3 id="org5d99861">Building Packages</h3>
<div class="outline-text-3" id="text-org5d99861">
<p>
The files that form a package are annotated with a "package" command, which
specifies the name of the package, which must match the name of the directory
in which the files appear.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">list/SList.java */</span>                |  <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">list/SListNode.java */</span>
                                     |
<span style="color: #4f97d7; font-weight: bold;">package</span> <span style="color: #a45bad;">list</span>;                        |  <span style="color: #4f97d7; font-weight: bold;">package</span> <span style="color: #a45bad;">list</span>;
                                     |
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> SList {                 |  <span style="color: #4f97d7; font-weight: bold;">class</span> SListNode {
  <span style="color: #ce537a; font-weight: bold;">SListNode</span> <span style="color: #7590db;">head</span>;                    |    Object item;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">size</span>;                          |    SListNode next;
}                                    |  }
</pre>
</div>

<p>
Here, the SListNode class and its fields are marked neither public, private, nor
protected. Instead, they have "package" protection, which falls somewhere
between "private" and "protected". Package protection is specified not by using
the word "package", but by using no modifier at all. Variables are package by
default unless declared public, private, or protected.
</p>

<p>
A class or variable with package protection is visible to any class in the same
package, but not to classes outside the package (i.e., files outside the
directory).  The files in a package are presumed to trust each other, and are
usually implemented by the same person.  Files outside the package can only see
the public classes, methods, and fields.  (Subclasses outside the package can
see the protected methods and fields as well.)
</p>

<p>
Before we knew about packages, we had to make the fields of SListNode public so
that SList could manipulate them.  Our list package above solves this problem
by giving SListNode and its fields package protection, so that the SList class
may use SListNodes freely, but outside applications cannot access them.
</p>

<p>
In Homework 4, you'll see a different approach.  There, the DListNode class is
public, so that DListNodes can be directly held by application programs, but
the "prev" and "next" fields have package protection, so an application cannot
access these fields or corrupt the DList ADT.  But an application can hop
quickly from node to node because it can store DListNode references and use
them as parameters in DList method calls.
</p>

<p>
Each public class must be declared in a file named after the class, but a class
with package protection can be declared in any .java file (usually found
together with a class that uses it).  So a public SList class and a package
SListNode class can both be declared in the file list/SList.java, if you feel
like it.
</p>

<p>
Compiling and running files in a package is a bit tricky, because it must be
done from outside the package, using the following syntax:
</p>

<div class="org-src-container">
<pre class="src src-shell">javac -g list/SList.java
java list.SList
</pre>
</div>

<p>
Here's the correspondence between declarations and their visibility.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Visible:</th>
<th scope="col" class="org-left">in the same package</th>
<th scope="col" class="org-left">in a subclass</th>
<th scope="col" class="org-left">everywhere</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">"public"</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
</tr>

<tr>
<td class="org-left">"protected"</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">default (package)</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">"private"</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>

</p>
</div>
</div>
</div>
<div id="org0fbb6c4" class="outline-2">
<h2 id="org0fbb6c4">ITERATORS</h2>
<div class="outline-text-2" id="text-org0fbb6c4">
<p>
In java.util there is a standard Java interface for iterating over sequences of
objects.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Iterator</span> {
  <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #bc6ec5; font-weight: bold;">hasNext</span>();
  <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #bc6ec5; font-weight: bold;">next</span>();
  <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">remove</span>();                          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">The remove() method is optional.</span>
}
</pre>
</div>

<p>
Part of Project 1 is to write a class RunIterator that implements an Iterator
for your RunLengthEncoding class. Its purpose is to provide an interface by
which other classes can read the runs in your run-length encoding, one by one.
</p>

<p>
An Iterator is like a bookmark.  Just as you can have many bookmarks in a book,
you can have many Iterators iterating over the same data structure, each one
independent of the others.  One Iterator can advance without disturbing other
Iterators that are iterating over the same data structure.
</p>

<p>
The first time  <code>next()</code>  is called on a newly constructed Iterator, it returns the
first item in the sequence.  Each subsequent time  <code>next()</code>  is called, it returns
the next item in the sequence.  After the Iterator has returned every item in
the sequence, every subsequent call to  <code>next()</code>  throws an exception and halts
with an error message.  (I find this annoying; I would prefer an interface in
which  <code>next()</code>  returns null.  The Java library designers disagree.)
</p>

<p>
To help you avoid triggering an exception, has <code>next()</code>  returns true if the
Iterator has more items to return, or false if it has already returned every
item in the sequence.  It is usually considered good practice to check
has <code>next()</code>  before calling  <code>next()</code> .  (In the next lecture we'll learn how to catch
exceptions; that will give us an alternative way to prevent our program from
crashing when  <code>next()</code>  throws an exception.)
</p>

<p>
There is usually no way to reset an Iterator back to the beginning of the
sequence. Instead, you construct a new Iterator.
</p>

<p>
Most data structures that support <code>Iterators</code> "implement" another interface in
<code>java.util</code> called "<code>Iterable</code>".
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">interface</span> <span style="color: #ce537a; font-weight: bold;">Iterable</span> {
  <span style="color: #ce537a; font-weight: bold;">Iterator</span> <span style="color: #bc6ec5; font-weight: bold;">iterator</span>();
}
</pre>
</div>

<p>
It is customary for applications that want to iterate over a data structure DS
to call <code>DS.iterate()</code>, which constructs and returns a DSIterator whose fields
are initialized so it is ready to return the first item in DS.
</p>

<p>
A benefit of creating an Iterable class with its own Iterator is that Java has
a simple built-in loop syntax, a second kind of "for each" loop, that iterates
over the items in a data structure.  Suppose we design an SList that implements
Iterator.  The following loop (which can appear in any class) iterates through
the items in an SList l.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #7590db;">o</span> : l) {
  System.out.println(o);
}
</pre>
</div>

<p>
This loop is equivalent to
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">Iterator</span> <span style="color: #7590db;">i</span> = l.iterator(); i.hasNext(); ) {
  <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #7590db;">o</span> = i.next();
  System.out.println(o);
}
</pre>
</div>

<p>
To make all this more concrete, here is a complete implementation of an
SListIterator class and a partial implementation of SList, both in the "list"
package.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">list/SListIterator.java */</span>

<span style="color: #4f97d7; font-weight: bold;">package</span> <span style="color: #a45bad;">list</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">util</span>.*;

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">SListIterator</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">Iterator</span> {
  <span style="color: #ce537a; font-weight: bold;">SListNode</span> <span style="color: #7590db;">n</span>;

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #bc6ec5; font-weight: bold;">SListIterator</span>(<span style="color: #ce537a; font-weight: bold;">SList</span> <span style="color: #7590db;">l</span>) {
    n = l.head;
  }

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #bc6ec5; font-weight: bold;">hasNext</span>() {
    <span style="color: #4f97d7; font-weight: bold;">return</span> n != <span style="color: #a45bad;">null</span>;
  }

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #bc6ec5; font-weight: bold;">next</span>() {
    <span style="color: #4f97d7; font-weight: bold;">if</span> (n == <span style="color: #a45bad;">null</span>) {
      <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">We'll learn about throwing exceptions in the next lecture. */</span>
      <span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">NoSuchElementException</span>();                       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">In java.util</span>
    }
    <span style="color: #ce537a; font-weight: bold;">Object</span> <span style="color: #7590db;">i</span> = n.item;
    n = n.next;
    <span style="color: #4f97d7; font-weight: bold;">return</span> i;
  }

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">remove</span>() {
    <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">Doing it the lazy way.  Remove this, motherf! */</span>
    <span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">UnsupportedOperationException</span>(<span style="color: #2d9574;">"Nice try, bozo."</span>); <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">In java.lang</span>
  }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">list/SList.java */</span>

<span style="color: #4f97d7; font-weight: bold;">package</span> <span style="color: #a45bad;">list</span>;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">util</span>.*;

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">SList</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">Iterable</span> {
  <span style="color: #ce537a; font-weight: bold;">SListNode</span> <span style="color: #7590db;">head</span>;
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">size</span>;

  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">Iterator</span> <span style="color: #bc6ec5; font-weight: bold;">iterator</span>() {
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">SListIterator</span>(<span style="color: #4f97d7; font-weight: bold;">this</span>);
  }

  [other methods here]
}
</pre>
</div>

<p>
Observe that an Iterator may mess up or even crash the program if the
structure it is iterating over changes.  For example, if the node "n" that an
SListIterator references is removed from the list, the SListIterator will not
be able to find the rest of the nodes.
</p>

<p>
An Iterator doesn't have to iterate over a data structure.  For example, you
can implement an Iterator subclass called Primes that returns each successive
prime number as an Integer object.
</p>
</div>
</div>
</div>
</body>
</html>
